from aiogram import Bot, types
from aiogram.types import ParseMode
from aiogram.utils import executor
from aiogram.utils.markdown import text, bold
from aiogram.dispatcher import Dispatcher
from aiogram.dispatcher.filters import Text
import sqlite3


import keyboard as kb


bot = Bot(token="5579231200:AAEqTgLXRKqt4ZhiYLL5raJNugOy4bDZU5c", parse_mode=types.ParseMode.HTML)
dp = Dispatcher(bot)


raspisanie = open("raspisanie.jpg", "rb")
it_cube71 = open("it_cube71.JPG", "rb")
sait = open("sait.JPG", "rb")


##


@dp.message_handler(commands=['start'])
async def process_start_command(message: types.Message):
    await bot.send_photo(message.from_user.id, it_cube71, caption="Привет! Тебя приветствует телеграмм бот, если Вы хотите более подробно узнать о моих функциях, <b>нажмите сюда</b> --> /help!", reply_to_message_id=message.message_id)
    markup = types.InlineKeyboardMarkup()
    btn_my_site = types.InlineKeyboardButton(text='НАШ САЙТ!', url='https://saitit.herokuapp.com/')
    markup.add(btn_my_site)
    await bot.send_message(message.chat.id, "Нажмите на кнопку и перейди на наш сайт для подачи заявки.", reply_markup=markup)


@dp.message_handler(commands=['help'])
async def process_help_command(message: types.Message):
    await message.reply(help_message)


@dp.message_handler(commands=['sait'])
async def process_start_command(message: types.Message):
    await bot.send_photo(message.from_user.id, sait, caption="", reply_to_message_id=message.message_id)
    markupp = types.InlineKeyboardMarkup()
    btn_my_sitex = types.InlineKeyboardButton(text='НАШ САЙТ!', url='https://saitit.herokuapp.com/')
    markupp.add(btn_my_sitex)
    await bot.send_message(message.chat.id, "Нажмите на кнопку и перейди на наш сайт для подачи заявки.", reply_markup=markupp)


@dp.message_handler(commands=['rm'])
async def process_rm_command(message: types.Message):
    await message.reply("Убираем шаблоны сообщений", reply_markup=kb.ReplyKeyboardRemove())

##


help_message = text(
    "-----------------------------------------------------------------------",
    "<b>Молодцы! Мы рады, что вы хотите о нас узнать.</b>",
    "-----------------------------------------------------------------------",
    "«IT-куб» – инновационная площадка дополнительного образования детей, направленная на развитие знаний и навыков в области программирования. Для ребенка это центр притяжения, место куда хочется вернуться и продолжить развиваться дальше. Этот эффект создаётся за счет качественно новой инфраструктуры и высокого уровня материально-технического оснащения, а также интересных образовательных программ.",
    "-----------------------------------------------------------------------",
    "Проект формирует современную образовательную экосистему, объединяющую компании-лидеров ИТ-рынка, опытных наставников и начинающих разработчиков от 7 до 17 лет.",
    "-----------------------------------------------------------------------",
    "<b>Справка для основных команд:</b>",
    "-----------------------------------------------------------------------",
    "/start - приветствие нового Пользователя",
    "-----------------------------------------------------------------------",
    "/sait - наш собственный сайт",
    "-----------------------------------------------------------------------",
    "/napravl - виды направлений",
    "/raspisan - расписание занятий",
    "/kontakt - контактные данные",
    "-----------------------------------------------------------------------",
    "<b>Кнопочное меню:</b>",
    "-----------------------------------------------------------------------",
    "/knopka1 - список команд",
    "/knopka2 - виды направлений",
    "/knopka3 - контактные данные",
    "-----------------------------------------------------------------------",
    "/inlain1 - Инлайн кнопка",
    "-----------------------------------------------------------------------",
    "/rm - убрать шаблоны",
    "-----------------------------------------------------------------------",
    sep="\n"
)


napravl_message = text(
    "-----------------------------------------------------------------------",
    "<b>Виды направлений.</b>",
    "-----------------------------------------------------------------------",
    "/gigiena - Цифровая гигиена и работа с большими данными.",
    "/promdiz - Промышленный дизайн.",
    "/web - Web-разработка.",
    "/cyazblk - Программирование на C-подобных языках.",
    "/razrvrar - Разработка VR/AR приложений.",
    "/robot - Робототехника.",
    "/python -  Программирование на языке Python.",
    "/razrmob - Мобильная разработка.",
    "/uuaxmat - Шахматы",
    "-----------------------------------------------------------------------",
    sep="\n"
)


kontakt_nom_message = text(
    "-----------------------------------------------------------------------",
    "<b>Контактные данные сотрудников:</b>",
    "-----------------------------------------------------------------------",
    "/kontakt_ped - номера телефонов педагогов",
    "/kontakt_lab - номера телефонов лаборантов",
    "/kontakt_adm - номер телефона администратора",
    "-----------------------------------------------------------------------",
    sep="\n"
)


kontakt_ped_message = text(
    "-----------------------------------------------------------------------",
    "<b>Контактные данные педагогов:</b>",
    "-----------------------------------------------------------------------",
    "+7-953-423-12-85 - Слюсарева Марина Валерьявна",
    "+7-905-627-19-56 - Дьячкова Елена Станиславовна",
    "+7-953-952-00-89 - Марейчева Лариса Ивановна",
    "+7-906-531-40-84 - Полухина Ирина Владимировна",
    "+7-950-906-65-56 - Рудаков Андрей Анатольевич",
    "+7-952-017-19-75 - Полосуев Сергей Владимирович",
    "-----------------------------------------------------------------------",
    sep="\n"
)


kontakt_lab_message = text(
    "-----------------------------------------------------------------------",
    "<b>Контактные данные лаборантов:</b>",
    "-----------------------------------------------------------------------",
    "+7-920-758-08-55 - Петраков Александр Александрович",
    "+7-906-624-22-78 - Казаков Дмитрий Никитович",
    "+7-953-423-86-99 - Бачарова Мария Евгеньевна",
    "+7-930-890-41-55 - Белякова Софья Владимировна",
    "+7-960-619-30-26 - Мезенцев Константин Алексеевич",
    "-----------------------------------------------------------------------",
    sep="\n"
)


kontakt_adm_message = text (
    "-----------------------------------------------------------------------",
    "<b>Контактные данные администратора:</b>",
    "-----------------------------------------------------------------------",
    "+7-920-766-80-22 - Пожидаева Валерия Андреевна",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_gigiena = text(
    "-----------------------------------------------------------------------",
    "                   <b>Цифровая гигиена.</b>                                      ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Слюсарева Марина Валерьявна                                                          ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-953-423-12-85                                                             ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник (13:45 - 15:25, 15:55 - 17:35)                      ",
    "Вторник           (13:45 - 15:25, 15:55 - 17:35)                ",
    "Среда               (15:00 - 16:40)                            ",
    "Пятница           (13:45 - 15:25)                              ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 36                                                  ",
    "кол-во детей в группе - 12                                               ",
    "кол-во групп - 3                                                         ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_promdiz = text(
    "-----------------------------------------------------------------------",
    "              <b>Промышленный дизайн.</b>                                       ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Дьячкова Елена Станиславовна                                                           ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-905-627-19-56                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Вторник             (15:55 - 17:30)                         ",
    "Среда                (15:55 - 17:30)                      ",
    "Четверг             (15:55 - 17:30)                         ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 36                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 3                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_cyazblk = text(
    "-----------------------------------------------------------------------",
    "       <b>Программирование на C-языках.</b>                                       ",
    "-----------------------------------------------------------------------",
    "                1️⃣ <b>Педагоги-лаборанты</b>                                           ",
    "-----------------------------------------------------------------------",
    "Мезенцев Константин Алексеевич                                                         ",
    "Казаков Дмитрий Никитович                                                        ",
    "Пожидаева Валерия Андреевна                                                            ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-960-619-30-26                                                             ",
    "Телефон - +7-920-766-80-22                                                             ",
    "Телефон - +7-906-624-22-78                                                             ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник    (15:00 - 16:40)                               ",
    "Вторник             (15:00 - 16:40)                         ",
    "Пятница             (15:00 - 16:40) .                       ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 36                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 3                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_web = text(
    "-----------------------------------------------------------------------",
    "                      <b>Web-разработка.</b>                                ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Марейчева Лариса Ивановна                                                              ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-953-952-00-89                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник   (15:00 - 16:40)                               ",
    "Вторник            (15:55 - 17:30)                         ",
    "Среда                (15:55 - 17:30)                      ",
    "Четверг            (15:00 - 16:40)                        ",
    "Пятница           (15:00 - 16:40) .                       ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 24                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 2                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_razrvrar = text(
    "-----------------------------------------------------------------------",
    "        <b>Разработка VR/AR приложений.</b>                                ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Полухина Ирина Владимировна                                                            ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-906-531-40-84                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник    (15:55 - 17:30)                               ",
    "Среда                  (13:45 - 15:25)                      ",
    "Четверг               (15:55 - 17:30)                        ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 36                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 3                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_robot = text(
    "-----------------------------------------------------------------------",
    "                       <b>Робототехника.</b>                                 ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Рудаков Андрей Анатольевич                                                             ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-950-906-65-56                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник    (15:50 - 16:40)                               ",
    "Пятница             (15:00 - 16:40)                          ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 24                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 2                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_python = text(
    "-----------------------------------------------------------------------",
    "<b>Программирование на языке Python.</b>                                    ",
    "-----------------------------------------------------------------------",
    "                  1️⃣ <b>Педагог-лаборант</b>                                           ",
    "-----------------------------------------------------------------------",
    "Петраков Александр Александрович                                                       ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-920-758-08-55                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Суббота             (10:40 - 13:20)                    ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 24                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 2                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_razrmob = text(
    "-----------------------------------------------------------------------",
    "                <b>Мобильная разработка.</b>                                 ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Щеглов Владимир Александрович                                                          ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - отсутствует                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник    (16:30 - 18:00)                               ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 24                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 2                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


group_uuaxmat = text(
    "-----------------------------------------------------------------------",
    "                           <b>Шахматы.</b>                                 ",
    "-----------------------------------------------------------------------",
    "                          1️⃣ <b>Педагог</b>                                      ",
    "-----------------------------------------------------------------------",
    "Полосуев Владимир Сергеевич                                                            ",
    "-----------------------------------------------------------------------",
    "                2️⃣ <b>Контактные данные</b>                                  ",
    "-----------------------------------------------------------------------",
    "Телефон - +7-952-017-19-75                                                              ",
    "-----------------------------------------------------------------------",
    "                       3️⃣ <b>Информация</b>                                      ",
    "-----------------------------------------------------------------------",
    "Понедельник-Пятница         (15:00 - 18:00)                               ",
    "-----------------------------------------------------------------------",
    "         <b>полное расписание</b> --> /raspisan                             ",
    "-----------------------------------------------------------------------",
    "общее кол-во детей - 12                                            ",
    "кол-во детей в группе - 12                                         ",
    "кол-во групп - 1                                                   ",
    "-----------------------------------------------------------------------",
    "         <b>вернуться обратно</b> --> /vernytsya                            ",
    "-----------------------------------------------------------------------",
    sep="\n"
)


@dp.message_handler(commands=['napravl'])
async def process_help_command(message: types.Message):
    await message.reply(napravl_message)


@dp.message_handler(commands=['raspisan'])
async def process_photo_command(message: types.Message):
    await bot.send_photo(message.from_user.id, raspisanie, caption="<b>Расписание занятий.</b>", reply_to_message_id=message.message_id)


@dp.message_handler(commands=['kontakt'])
async def process_help_command(message: types.Message):
    await message.reply(kontakt_nom_message)


@dp.message_handler(commands=['kontakt_ped'])
async def process_help_command(message: types.Message):
    await message.reply(kontakt_ped_message)


@dp.message_handler(commands=['kontakt_lab'])
async def process_help_command(message: types.Message):
    await message.reply(kontakt_lab_message)


@dp.message_handler(commands=['kontakt_adm'])
async def process_help_command(message: types.Message):
    await message.reply(kontakt_adm_message)


@dp.message_handler(commands=['gigiena'])
async def process_help_command(message: types.Message):
    await message.reply(group_gigiena)


@dp.message_handler(commands=['promdiz'])
async def process_help_command(message: types.Message):
    await message.reply(group_promdiz)


@dp.message_handler(commands=['cyazblk'])
async def process_help_command(message: types.Message):
    await message.reply(group_cyazblk)


@dp.message_handler(commands=['web'])
async def process_help_command(message: types.Message):
    await message.reply(group_web)


@dp.message_handler(commands=['razrvrar'])
async def process_help_command(message: types.Message):
    await message.reply(group_razrvrar)


@dp.message_handler(commands=['robot'])
async def process_help_command(message: types.Message):
    await message.reply(group_robot)


@dp.message_handler(commands=['python'])
async def process_help_command(message: types.Message):
    await message.reply(group_python)


@dp.message_handler(commands=['razrmob'])
async def process_help_command(message: types.Message):
    await message.reply(group_razrmob)


@dp.message_handler(commands=['uuaxmat'])
async def process_help_command(message: types.Message):
    await message.reply(group_uuaxmat)


@dp.message_handler(commands=['knopka1'])
async def process_hi4_command(message: types.Message):
    await message.reply("<b>Нажмите на нужную Вам команду:</b>", reply_markup=kb.knopkao)


@dp.message_handler(Text(equals="Вернуться в начало"))
async def process_hi4_command(message: types.Message):
    await message.reply("<b>Нажмите на нужную Вам команду:</b>", reply_markup=kb.knopkao)


@dp.message_handler(commands=['vernytsya'])
async def process_hi4_command(message: types.Message):
    await message.reply("<b>Нажмите на нужное Вам направление:</b>", reply_markup=kb.knopkat)


@dp.message_handler(commands=['knopka2'])
async def process_hi4_command(message: types.Message):
    await message.reply("<b>Нажмите на нужное Вам направление:</b>", reply_markup=kb.knopkat)


@dp.message_handler(commands=['knopka3'])
async def process_hi4_command(message: types.Message):
    await message.reply("<b>Нажмите на нужные Вам контактные данные::</b>", reply_markup=kb.knopkaf)


@dp.message_handler(Text(equals="🅽🅰🅿🆁🅰🆅🅻🅴🅽🅸🆈🅰"))
async def with_puree(message: types.Message):
    await message.reply("<b>Нажмите на нужное Вам направление:</b>", reply_markup=kb.knopkat)


@dp.message_handler(Text(equals="🆁🅰🆂🅿🅸🆂🅰🅽🅸🅴"))
async def with_puree(message: types.Message):
    await bot.send_photo(message.from_user.id, raspisanie, caption="<b>Расписание занятий.</b>", reply_to_message_id=message.message_id)


@dp.message_handler(Text(equals="🅺🅾🅽🆃🅰🅺🆃_🅽🅾🅼"))
async def with_puree(message: types.Message):
    await message.reply("<b>Нажмите на нужные Вам контактные данные:</b>", reply_markup=kb.knopkaf)


@dp.message_handler(Text(equals="🅺🅾🅽🆃🅰🅺🆃_🅿🅴🅳"))
async def with_puree(message: types.Message):
    await message.reply(kontakt_ped_message)


@dp.message_handler(Text(equals="🅺🅾🅽🆃🅰🅺🆃_🅻🅰🅱"))
async def with_puree(message: types.Message):
    await message.reply(kontakt_lab_message)


@dp.message_handler(Text(equals="🅺🅾🅽🆃🅰🅺🆃_🅰🅳🅼"))
async def with_puree(message: types.Message):
    await message.reply(kontakt_ped_message)


@dp.message_handler(Text(equals="🅶🅸🅶🅸🅴🅽🅰"))
async def with_puree(message: types.Message):
    await message.reply(group_gigiena)


@dp.message_handler(Text(equals="🅿🆁🅾🅼🅳🅸🆉🅰🆈🅽"))
async def with_puree(message: types.Message):
    await message.reply(group_promdiz)


@dp.message_handler(Text(equals="🅿🆈🆃🅷🅾🅽"))
async def with_puree(message: types.Message):
    await message.reply(group_python)


@dp.message_handler(Text(equals="🆆🅴🅱"))
async def with_puree(message: types.Message):
    await message.reply(group_web)


@dp.message_handler(Text(equals="🅲🆈🅰🆉🆈🅺"))
async def with_puree(message: types.Message):
    await message.reply(group_cyazblk)


@dp.message_handler(Text(equals="🆁🅰🆉🆁🆅🆁🅰🆁"))
async def with_puree(message: types.Message):
    await message.reply(group_razrvrar)


@dp.message_handler(Text(equals="🆁🅾🅱🅾🆃"))
async def with_puree(message: types.Message):
    await message.reply(group_robot)


@dp.message_handler(Text(equals="🆁🅰🆉🆁🅼🅾🅱"))
async def with_puree(message: types.Message):
    await message.reply(group_razrmob)


@dp.message_handler(Text(equals="🆄🆄🅰🆇🅼🅰🆃"))
async def with_puree(message: types.Message):
    await message.reply(group_uuaxmat)


@dp.callback_query_handler(lambda c: c.data == 'knopka1')
async def process_callback_button1(callback_query: types.CallbackQuery):
    await bot.answer_callback_query(callback_query.id)
    await bot.send_message(callback_query.from_user.id, 'Нажата первая кнопка!', reply_markup=kb.knopkat)


@dp.callback_query_handler(lambda c: c.data == 'knopka1')
async def process_callback_button1(callback_query: types.CallbackQuery):
    await bot.answer_callback_query(callback_query.id)
    await bot.send_message(callback_query.from_user.id, 'Нажата первая кнопка!', reply_markup=kb.knopkat)


@dp.callback_query_handler(lambda c: c.data == 'knopka2')
async def mainMenu(call: types.CallbackQuery):
    await call.message.answer_photo(open("raspisanie.jpg", "rb"), "<b>Расписание занятий.</b>")
    await call.message.delete()


@dp.callback_query_handler(lambda c: c.data == 'knopka17')
async def process_callback_button1(callback_query: types.CallbackQuery):
    await bot.answer_callback_query(callback_query.id)
    await bot.send_message(callback_query.from_user.id, 'Нажата третья кнопка!', reply_markup=kb.knopkaf)


@dp.callback_query_handler(lambda c: c.data == 'knopka17')
async def process_callback_button1(callback_query: types.CallbackQuery):
    await bot.answer_callback_query(callback_query.id)
    await bot.send_message(callback_query.from_user.id, 'Нажата третья кнопка!', reply_markup=kb.knopkaf)


@dp.message_handler(commands=['inlain1'])
async def process_command_2(message: types.Message):
    await message.reply("Отправляю все возможные кнопки", reply_markup=kb.inline_kb_full)


if __name__ == '__main__':
    executor.start_polling(dp)